In [61]:
import pandas as pd
objs = pd.Series([4.5, 7.2, -5.3, 3.6], index=['d', 'b', 'a', 'c'])
objs

d    4.5
b    7.2
a   -5.3
c    3.6
dtype: float64

In [62]:
#reindex()實體方法->重新改變索引
#reindex()重新排序索引或保留想要的索引
objs.reindex(['a', 'b', 'c', 'd'])

a   -5.3
b    7.2
c    3.6
d    4.5
dtype: float64

In [63]:
objs.reindex(['a', 'b', 'c'])

a   -5.3
b    7.2
c    3.6
dtype: float64

In [64]:
#DataFrame可以使用reindex()改變列或欄的排序或保留想要的索引
import numpy as np
#np.arange(9).reshape(3,3)使用ndarray來建立DataFrame
frame = pd.DataFrame(np.arange(9).reshape(3,3),index=['a','c','d'],columns=['台北', '台中', '高雄'])
frame

   台北  台中  高雄
a   0   1   2
c   3   4   5
d   6   7   8

In [65]:
frame.reindex(['a', 'd', 'c'])

   台北  台中  高雄
a   0   1   2
d   6   7   8
c   3   4   5

In [66]:
frame.reindex(['a', 'c'])

   台北  台中  高雄
a   0   1   2
c   3   4   5

In [67]:
#reindex(columns=[])改變欄位的索引
frame.reindex(columns=['台北', '高雄', '台中'])

   台北  高雄  台中
a   0   2   1
c   3   5   4
d   6   8   7

In [68]:
#reindex(columns=[])保留欄位的索引
frame.reindex(columns=['台北', '台中'])

   台北  台中
a   0   1
c   3   4
d   6   7

In [69]:
#drop()實體方法 --> 預設移除列,drop(,axis=1)
data = pd.DataFrame(np.arange(16).reshape(4,4),
                   index=['台北','台中', '台南', '高雄'],
                   columns=['one', 'two', 'three', 'four'])
data

    one  two  three  four
台北    0    1      2     3
台中    4    5      6     7
台南    8    9     10    11
高雄   12   13     14    15

In [70]:
data.drop(['台北', '台中'])

    one  two  three  four
台南    8    9     10    11
高雄   12   13     14    15

In [71]:
data.drop(['one', 'two'],axis=1)

    three  four
台北      2     3
台中      6     7
台南     10    11
高雄     14    15

In [72]:
data = pd.DataFrame(np.arange(16).reshape((4, 4)),
                   index=['台北','台中','台南', '高雄'],
                   columns=['one', 'two', 'three', 'four'])
data

    one  two  three  four
台北    0    1      2     3
台中    4    5      6     7
台南    8    9     10    11
高雄   12   13     14    15

In [73]:
data[['one', 'two', 'three']]

    one  two  three
台北    0    1      2
台中    4    5      6
台南    8    9     10
高雄   12   13     14

In [74]:
data[:2]

    one  two  three  four
台北    0    1      2     3
台中    4    5      6     7

In [75]:
data[:1]

    one  two  three  four
台北    0    1      2     3

In [76]:
data[-2:]

    one  two  three  four
台南    8    9     10    11
高雄   12   13     14    15

In [77]:
#bs = pd.Series([True, False, False, False]) 不是任意的Series就可以過濾
#data[bs]
data

    one  two  three  four
台北    0    1      2     3
台中    4    5      6     7
台南    8    9     10    11
高雄   12   13     14    15

In [78]:
filterData=data['four'] > 10
data[filterData]

    one  two  three  four
台南    8    9     10    11
高雄   12   13     14    15

In [79]:
data < 10

      one    two  three   four
台北   True   True   True   True
台中   True   True   True   True
台南   True   True  False  False
高雄  False  False  False  False

In [80]:
data[data < 10] = 0
data

    one  two  three  four
台北    0    0      0     0
台中    0    0      0     0
台南    0    0     10    11
高雄   12   13     14    15

In [81]:
#實體屬性loc[],iloc[]
data = pd.DataFrame(np.arange(16).reshape((4, 4)),
                   index=['台北','台中','台南', '高雄'],
                   columns=['one', 'two', 'three', 'four'])
data

    one  two  three  four
台北    0    1      2     3
台中    4    5      6     7
台南    8    9     10    11
高雄   12   13     14    15

In [82]:
data.loc['台北',['two', 'three']]

two      1
three    2
Name: 台北, dtype: int64

In [83]:
data.iloc[0,[1, 2]]

two      1
three    2
Name: 台北, dtype: int64

In [84]:
data.iloc[2]

one       8
two       9
three    10
four     11
Name: 台南, dtype: int64

In [85]:
data.loc['台南']

one       8
two       9
three    10
four     11
Name: 台南, dtype: int64

In [86]:
import pandas as pd
dataFrame = pd.read_csv('各鄉鎮市區人口密度.csv')
dataFrame

,statistic_yyy,site_id,people_total,area,population_density
0,統計年,區域別,年底人口數,土地面積,人口密度
1,106,新北市板橋區,551480,23.1373,23835
2,106,新北市三重區,387484,16.317,23747
3,106,新北市中和區,413590,20.144,20532
4,106,新北市永和區,222585,5.7138,38956
...,...,...,...,...,...
371,NaN,NaN,NaN,NaN,NaN
372,NaN,說明：1.人口密度係指每單位土地面積內之人口數。,NaN,NaN,NaN
373,NaN,2.96年12月起，我國土地面積增列東沙群島(2.38平方公里)及南沙群島(0.4896平方公里),NaN,NaN,NaN
374,NaN,，由高雄市代管；原金門縣烏坵鄉面積，因重測由2.6平方公里修正為1.2平方公里。,NaN,NaN,NaN
375,NaN,3.104年12月南沙太平島交通基礎整建工程竣工，增加面積0.0149平方公里。,NaN,NaN,NaN

In [87]:
dataFrame.dtypes

statistic_yyy         object
site_id               object
people_total          object
area                  object
population_density    object
dtype: object

In [88]:
dataFrame.shape

(376, 5)

In [89]:
dataFrame[:1]

  statistic_yyy site_id people_total  area population_density
0           統計年     區域別        年底人口數  土地面積               人口密度

In [90]:
dataFrame.loc[0]

statistic_yyy           統計年
site_id                 區域別
people_total          年底人口數
area                   土地面積
population_density     人口密度
Name: 0, dtype: object

In [91]:
dataFrame.columns = dataFrame.loc[0]
dataFrame

,統計年,區域別,年底人口數,土地面積,人口密度
0,統計年,區域別,年底人口數,土地面積,人口密度
1,106,新北市板橋區,551480,23.1373,23835
2,106,新北市三重區,387484,16.317,23747
3,106,新北市中和區,413590,20.144,20532
4,106,新北市永和區,222585,5.7138,38956
...,...,...,...,...,...
371,NaN,NaN,NaN,NaN,NaN
372,NaN,說明：1.人口密度係指每單位土地面積內之人口數。,NaN,NaN,NaN
373,NaN,2.96年12月起，我國土地面積增列東沙群島(2.38平方公里)及南沙群島(0.4896平方公里),NaN,NaN,NaN
374,NaN,，由高雄市代管；原金門縣烏坵鄉面積，因重測由2.6平方公里修正為1.2平方公里。,NaN,NaN,NaN
375,NaN,3.104年12月南沙太平島交通基礎整建工程竣工，增加面積0.0149平方公里。,NaN,NaN,NaN

In [92]:
dataFrame=dataFrame.drop(0)

In [93]:
dataFrame

,統計年,區域別,年底人口數,土地面積,人口密度
1,106,新北市板橋區,551480,23.1373,23835
2,106,新北市三重區,387484,16.317,23747
3,106,新北市中和區,413590,20.144,20532
4,106,新北市永和區,222585,5.7138,38956
5,106,新北市新莊區,416524,19.7383,21102
...,...,...,...,...,...
371,NaN,NaN,NaN,NaN,NaN
372,NaN,說明：1.人口密度係指每單位土地面積內之人口數。,NaN,NaN,NaN
373,NaN,2.96年12月起，我國土地面積增列東沙群島(2.38平方公里)及南沙群島(0.4896平方公里),NaN,NaN,NaN
374,NaN,，由高雄市代管；原金門縣烏坵鄉面積，因重測由2.6平方公里修正為1.2平方公里。,NaN,NaN,NaN
375,NaN,3.104年12月南沙太平島交通基礎整建工程竣工，增加面積0.0149平方公里。,NaN,NaN,NaN

In [94]:
dataFrame[-30:]

,統計年,區域別,年底人口數,土地面積,人口密度
346,106,澎湖縣七美鄉,3856,6.9868,552
347,106,基隆市中正區,52163,10.2118,5108
348,106,基隆市七堵區,53972,56.2659,959
349,106,基隆市暖暖區,38708,22.8283,1696
350,106,基隆市仁愛區,44314,4.2335,10467
351,106,基隆市中山區,47908,10.5238,4552
352,106,基隆市安樂區,82358,18.025,4569
353,106,基隆市信義區,52035,10.6706,4876
354,106,新竹市東區,212553,33.5768,6330
355,106,新竹市北區,150636,15.7267,9578
356,106,新竹市香山區,77943,54.8491,1421
357,106,嘉義市東區,122103,30.1556,4049
358,106,嘉義市西區,147295,29.87,4931
359,106,金門縣金城鎮,43285,21.713,1994
360,106,金門縣金湖鎮,29413,41.696,705
361,106,金門縣金沙鎮,20535,41.19,499
362,106,金門縣金寧鄉,30838,29.854,1033
363,106,金門縣烈嶼鄉,12700,16.003,794
364,106,金門縣烏坵鄉,685,1.2,571
365,106,連江縣南竿鄉,7544,10.4,725
366,106,連江縣北竿鄉,2360,9.9,238
367,106,連江縣莒光鄉,1624,4.7,346
368,106,連江縣東引鄉,1352,3.8,356
369,106,東沙群島,…,2.38,…
370,106,南沙群島,…,0.5045,…
371,NaN,NaN,NaN,NaN,NaN
372,NaN,說明：1.人口密度係指每單位土地面積內之人口數。,NaN,NaN,NaN
373,NaN,2.96年12月起，我國土地面積增列東沙群島(2.38平方公里)及南沙群島(0.4896平方公里),NaN,NaN,NaN
374,NaN,，由高雄市代管；原金門縣烏坵鄉面積，因重測由2.6平方公里修正為1.2平方公里。,NaN,NaN,NaN
375,NaN,3.104年12月南沙太平島交通基礎整建工程竣工，增加面積0.0149平方公里。,NaN,NaN,NaN

In [95]:
dataFrame.drop([371, 372, 373, 374, 375])

0    統計年     區域別   年底人口數     土地面積   人口密度
1    106  新北市板橋區  551480  23.1373  23835
2    106  新北市三重區  387484   16.317  23747
3    106  新北市中和區  413590   20.144  20532
4    106  新北市永和區  222585   5.7138  38956
5    106  新北市新莊區  416524  19.7383  21102
..   ...     ...     ...      ...    ...
366  106  連江縣北竿鄉    2360      9.9    238
367  106  連江縣莒光鄉    1624      4.7    346
368  106  連江縣東引鄉    1352      3.8    356
369  106    東沙群島      …      2.38     …
370  106    南沙群島      …    0.5045     …

[370 rows x 5 columns]

In [99]:
dataFrame=dataFrame[:370]

0    統計年     區域別   年底人口數     土地面積   人口密度
1    106  新北市板橋區  551480  23.1373  23835
2    106  新北市三重區  387484   16.317  23747
3    106  新北市中和區  413590   20.144  20532
4    106  新北市永和區  222585   5.7138  38956
5    106  新北市新莊區  416524  19.7383  21102
..   ...     ...     ...      ...    ...
366  106  連江縣北竿鄉    2360      9.9    238
367  106  連江縣莒光鄉    1624      4.7    346
368  106  連江縣東引鄉    1352      3.8    356
369  106    東沙群島      …      2.38     …
370  106    南沙群島      …    0.5045     …

[370 rows x 5 columns]